ERM/src/InformationRegisters/ИерархияКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ИерархияКонтрагентов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГоловнойКонтрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ERM/src/InformationRegisters/ЛогВыгрузкиPowerBI/ЛогВыгрузкиPowerBI.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛогВыгрузкиPowerBI</name>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>НомерСеанса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Событие</name>
    <type>
      <types>EnumRef.ТипыСобытийИнтеграцииPowerBI</types>
    </type>
  </resources>
  <resources>
    <name>Операция</name>
    <type>
      <types>EnumRef.ОперацииPowerBI</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоОшибка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПорядковыйНомерСобытия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторСеанса</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Источник</name>
    <type>
      <types>DefinedType.ИсточникДанныхPowerBI</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERM/src/InformationRegisters/ИерархияКонтрагентов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

#Область PowerBI

// Описание
// Выполняет выгрузку данных в Power BI
// Параметры:
// 	Клиент - Ссылка на клиента, по которому нужно выгрузить иерархию
// 	ПараметрыЛогирования - Структура с параметрами для записи логов
// Возвращаемое значение:
// 	Структура - включает поля Результат, Сообщение.
Функция ВыгрузитьДанныеДляPowerBI(Клиент, ПараметрыЛогирования) Экспорт
	
	СтруктураРезультата = Новый Структура("Результат, Сообщение", Ложь, "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИерархияКонтрагентовСрезПоследних.Контрагент КАК Контрагент,
		|	ИерархияКонтрагентовСрезПоследних.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
		|	ИерархияКонтрагентовСрезПоследних.SalesAccount КАК SalesAccount
		|ИЗ
		|	РегистрСведений.ИерархияКонтрагентов.СрезПоследних КАК ИерархияКонтрагентовСрезПоследних
		|ГДЕ
		|	ИерархияКонтрагентовСрезПоследних.Контрагент = &Контрагент";
	Запрос.УстановитьПараметр("Контрагент", Клиент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	НЗ = ВнешниеИсточникиДанных.ERM_BI.Таблицы.dbo_ClientHierarchy.СоздатьНаборЗаписей();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ЗаписьНабора = НЗ.Добавить();
		ЗаписьНабора.ClientID = ВыборкаДетальныеЗаписи.Контрагент.УникальныйИдентификатор();
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ГоловнойКонтрагент) Тогда
			ЗаписьНабора.ParentClientID = ВыборкаДетальныеЗаписи.ГоловнойКонтрагент.УникальныйИдентификатор();
		Иначе
			ЗаписьНабора.ParentClientID = NULL;
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.SalesAccount) Тогда
			ЗаписьНабора.SalesAccountID = ВыборкаДетальныеЗаписи.SalesAccount.УникальныйИдентификатор();
		Иначе
			ЗаписьНабора.SalesAccountID = NULL;
		КонецЕсли;
		
	КонецЦикла;

	ПараметрыЛогирования.Событие = Перечисления.ТипыСобытийИнтеграцииPowerBI.НачалоЗаписи;
	ПараметрыЛогирования.Комментарий = "Данные по иерархии";
	РегистрыСведений.ЛогВыгрузкиPowerBI.ЗалогироватьСобытие(ПараметрыЛогирования);
	Попытка
		НЗ.Записать();
	Исключение
		СтруктураРезультата.Сообщение = ОписаниеОшибки();
		Возврат СтруктураРезультата;
	КонецПопытки;
	ПараметрыЛогирования.Событие = Перечисления.ТипыСобытийИнтеграцииPowerBI.ОкончаниеЗаписи;
	РегистрыСведений.ЛогВыгрузкиPowerBI.ЗалогироватьСобытие(ПараметрыЛогирования);
	ПараметрыЛогирования.Комментарий = "";
	
	СтруктураРезультата.Результат = Истина;
	Возврат СтруктураРезультата;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

#КонецЕсли
